In [47]:
import pandas as pd

In [48]:
df = pd.read_csv("demo.csv")       # load the csv

In [49]:
df.shape            # returns the rows and cloumnns

(100, 7)

In [50]:
df.isnull().sum()           # it returns the null total null values with columns

ID                   0
Age                  0
Salary              10
Gender               0
Experience           5
Purchased            0
Product_Category     0
dtype: int64

In [51]:
df.head(5)          # for seeing first n rows 
df.tail(5)          # for seeing last n rows

     ID  Age    Salary  Gender  Experience  Purchased Product_Category
95   96   59   80680.0  Female        31.0          1                D
96   97   56       NaN  Female        22.0          1                B
97   98   58  112092.0  Female        21.0          0                A
98   99   45   75859.0  Female        24.0          1                A
99  100   24   51309.0  Female         NaN          1                D

In [52]:
df.info()           # info about the data or the csv file with column non-null count and dtype

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ID                100 non-null    int64
 1   Age               100 non-null    int64
 2   Salary            90 non-null     float64
 3   Gender            100 non-null    object
 4   Experience        95 non-null     float64
 5   Purchased         100 non-null    int64
 6   Product_Category  100 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 5.6+ KB

In [53]:
df.describe()           # provides summary statisctics of std min max etc...

               ID         Age         Salary  Experience   Purchased
count  100.000000  100.000000      90.000000   95.000000  100.000000
mean    50.500000   37.910000   76605.311111   21.905263    0.540000
std     29.011492   12.219454   28434.734078   11.129866    0.500908
min      1.000000   18.000000   25854.000000    0.000000    0.000000
25%     25.750000   26.750000   50980.500000   15.000000    0.000000
50%     50.500000   38.000000   77862.500000   24.000000    1.000000
75%     75.250000   46.250000  103295.500000   32.000000    1.000000
max    100.000000   59.000000  119856.000000   39.000000    1.000000

In [54]:
df.columns          # list coolumns

Index(['ID', 'Age', 'Salary', 'Gender', 'Experience', 'Purchased',
       'Product_Category'],
      dtype='object')

In [55]:
df.dtypes           # list data types

ID                    int64
Age                   int64
Salary              float64
Gender               object
Experience          float64
Purchased             int64
Product_Category     object
dtype: object

In [69]:
df.fillna(df['Salary'].mean(), inplace=True)

# df.isnull().sum()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ID                100 non-null    int64
 1   Age               100 non-null    int64
 2   Salary            100 non-null    float64
 3   Gender            100 non-null    object
 4   Experience        100 non-null    float64
 5   Purchased         100 non-null    int64
 6   Product_Category  100 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 5.6+ KB

In [ ]:
df.dropna()         # Droppped columns which have null valued